backend_task_manager/app/controllers/tasks_controller.rb

    task = Task.new(task_params)
    if task.save
---
INSERT INTO "tasks" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "New Task"], ["description", "This is a new task"], ["created_at", "2024-10-19 15:21:05.682635"], ["updated_at", "2024-10-19 15:21:05.682635"]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "New Task ram ram ram"], ["description", "This is a new task"], ["updated_at", "2024-10-19 15:47:16.715942"], ["id", 1]]